class User {

    // ตัวอย่าง data ในคลาส
    private var age: Int = 41
    private var money: Int = 1000

    // ตัวอย่างฟังก์ชันภายใน Class
    fun work(): Int {
        return money+10
    }
}

fun main(args: Array<String>) {

    // ในส่วนนี้คือส่วนที่เรียกกว่าการสร้าง Object หรือ ง่าย ๆ คือการเปลี่ยนพิมพ์เขียว
    // ที่ไม่มีชีวิต ให้มีชีวิต และ เรียกใช้งานได้เลย โดยใช้เป็นรูปแบบ = ตามด้วยชื่อคลาส
    // และ ปิดด้วยเครื่องหมายวงเล็บ เปิด และ ปิด ในตัวเอง
    val user1 = User()

    //กรณีนี้เป็นการเรียกใช้งาน Object ที่สร้างขึ้น โดยเราจะใช้ผ่านชื่อตัวแปร และ ตามด้วย
    //ชื้่อฟังก์ชัน หรือ ข้อมูลที่ต้องการได้เลย
    println("${user1.work()}")
    //1010
}

